ИС_СПОРТ_2022/src/Reports/ДанныеПоСпортивнымРазрядамИЗваниям/ДанныеПоСпортивнымРазрядамИЗваниям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДанныеПоСпортивнымРазрядамИЗваниям</name>
</mdclass:Report>

ИС_СПОРТ_2022/src/InformationRegisters/ПодтвержденныеРазрядыСпортсменов/ПодтвержденныеРазрядыСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодтвержденныеРазрядыСпортсменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПодтверждающегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтверждающегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазрядУдалить</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Reports/ДанныеПоСпортивнымРазрядамИЗваниям/Forms/ФормаРасшифровки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрическийСписок = новый ТаблицаЗначений;
	ПараметрическийСписок.Колонки.Добавить("Значение");
	ПараметрическийСписок.Колонки.Добавить("Номер",Новый ОписаниеТипов("Число"));
	Для счётчик = 1 по Параметры.СписокПараметр.Количество() Цикл
		Элемент = ПараметрическийСписок.Добавить();
		Элемент.Номер = счётчик;
	КонецЦикла;
	ПараметрическийСписок.ЗагрузитьКолонку(Параметры.СписокПараметр.ВыгрузитьЗначения(), 0);
	Список.Загрузить(ПараметрическийСписок);
	Заголовок = Параметры.ИмяТаблицы;
	Если Параметры.Спорт <> Неопределено тогда
		 Заголовок = Заголовок+" - "+НРег(Параметры.Спорт);
	КонецЕсли;
	 
	Если Параметры.НачалоПериода <> Неопределено тогда
		Заголовок =Заголовок + " " + Параметры.НачалоПериода;
	КонецЕсли;
	 
	Если Параметры.КонецПериода <> Неопределено И Параметры.НачалоПериода <> Неопределено тогда
		Заголовок = Заголовок+" - "+Параметры.КонецПериода;
	ИначеЕсли Параметры.КонецПериода <> Неопределено тогда
		Заголовок = Заголовок+" "+Параметры.КонецПериода;
	КонецЕсли;
	// {Рарус dotere #23028 -Смена заголовка колонки 2022.01.28
	Если Параметры.ИмяТаблицы = "Общая численность тренеров" ИЛИ Параметры.ИмяТаблицы = "Число спортивных судей"
	ИЛИ Параметры.ИмяТаблицы = "Присвоено тренерских званий" ИЛИ Параметры.ИмяТаблицы = "Заслуженный тренер России"
	ИЛИ Параметры.ИмяТаблицы = "Заслуженный работник физической культуры Российской Федерации" 
	ИЛИ Параметры.ИмяТаблицы = "Присуждены другие государственные почетные звания и награды" Тогда
		
	    Элементы.СписокЗначение.Заголовок = "Тренер";
		
	Иначе
		
		Элементы.СписокЗначение.Заголовок = "Спортсмен";
		
	КонецЕсли;
	// }Рарус dotere #23028 -Смена заголовка колонки 2022.01.28
	
	
	// {Рарус dotere #23028 -Подставляет в таблицу разряды 2022.01.26
	Если Параметры.ИмяТаблицы = "Количество других разрядов" ИЛИ Параметры.ИмяТаблицы = "Присвоено других разрядов за период" ИЛИ Параметры.ИмяТаблицы = "Подтверждено других разрядов за период" Тогда
		
		Элементы.СписокРазряд.Видимость = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
			|	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд
			|ИЗ
			|	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СтруктураПоиска = Новый Структура("Спортсмен");
		
		Для Каждого Строка Из Список Цикл
			СтруктураПоиска.Спортсмен = Строка.Значение;
			Пока ВыборкаДетальныеЗаписи.НайтиСледующий(СтруктураПоиска) Цикл
				 Строка.Разряд = ВыборкаДетальныеЗаписи.Разряд;
			КонецЦикла;
		КонецЦикла;
	Иначе
		Элементы.СписокРазряд.Видимость = Ложь;
	КонецЕсли;
	// }Рарус dotere #23028 -Подставляет в таблицу разряды 2022.01.26
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПоказатьЗначение(,Элемент.Родитель.ТекущиеДанные.Значение);
КонецПроцедуры
